db_test-wsman

<ruby>
home_dir = Dir.home
directory_name = "#{home_dir}/msf_#{framework.db.workspace.name}_output"
Dir.mkdir(directory_name) unless File.exist?(directory_name)

framework.db.hosts.each do |host|
  host.services.each do |service|
    if service.name == "http" || service.name == "www" || service.name == "http-proxy"
      wsman_cmd = "curl -vvv --header 'Content-Type: application/soap+xml;charset=UTF-8' --header 'WSMANIDENTIFY: unauthenticated' http://137.117.58.204:1221/wsman --data \"<s:Envelope xmlns:s='http://www.w3.org/2003/05/soap-envelope' xmlns:wsmid='http://schemas.dmtf.org/wbem/wsman/identity/1/wsmanidentity.xsd'><s:Header/><s:Body><wsmid:Identify/></s:Body></s:Envelope>\" | tee #{directory_name}/msf-wsman-output-#{host.address}-#{service.port}-http.txt"
      print "\n\n"
      print_status "Running wsman on #{host.address}:#{service.port}"
      print_status "#{wsman_cmd}"
      run = system wsman_cmd
    end
  end
  host.services.each do |service|
    if service.name == "https" || service.name == "ssl/https" || service.name == "ssl/http"
      wsman_cmd = "curl -vvv --header 'Content-Type: application/soap+xml;charset=UTF-8' --header 'WSMANIDENTIFY: unauthenticated' http://137.117.58.204:1221/wsman --data \"<s:Envelope xmlns:s='http://www.w3.org/2003/05/soap-envelope' xmlns:wsmid='http://schemas.dmtf.org/wbem/wsman/identity/1/wsmanidentity.xsd'><s:Header/><s:Body><wsmid:Identify/></s:Body></s:Envelope>\" | tee #{directory_name}/msf-wsman-output-#{host.address}-#{service.port}-https.txt"
      print "\n\n"
      print_status "Running wsman on #{host.address}:#{service.port}"
      print_status "#{wsman_cmd}"
      run = system wsman_cmd
    end
  end
end
</ruby>
